// 一线
const firstTierCity = ['上海', '北京', '深圳', '广州'];
// 新一线
const newFirstTierCity = ['成都', '长沙', '合肥', '杭州', '天津', '重庆', '郑州', '苏州', '东莞', '武汉', '西安', '无锡', '宁波', '南京', '青岛'];
// 二线
const secondTierCity = ['佛山', '常州', '长春', '徐州', '潍坊', '沈阳', '大连', '南通', '绍兴', '兰州', '昆明', '济南', '石家庄', '南宁', '泉州', '贵阳', '台州', '厦门', '福州', '哈尔滨', '金华', '嘉兴', '太原', '烟台', '珠海', '温州', '南昌', '惠州', '保定','中山'];
// 三线
const thirdTierCity = ['乌鲁木齐', '临沂', '海口', '湖州', '唐山', '济宁', '廊坊', '泰州', '芜湖', '汕头', '邯郸', '江门', '淮安', '绵阳', '连云港', '阜阳', '威海', '桂林', '漳州', '遵义', '衡阳', '柳州', '襄阳', '莆田', '湛江', '上饶', '德州', '肇庆', '周口', '株洲', '岳阳', '聊城', '常德', '宜春', '六安', '蚌埠', '丽水', '鄂尔多斯', '安庆', '信阳', '扬州', '盐城', '洛阳', '赣州', '呼和浩特' ,'镇江', '淄博', '银川', '南阳', '新乡', '咸阳', '三亚', '宜昌', '宿迁', '沧州', '九江', '菏泽', '滁州', '揭阳', '邢台', '泰安', '宁德', '商丘', '荆州', '东营', '枣庄', '马鞍山', '包头', '南充', '安阳'];
// 四线
const FourthTierCity = ['舟山', '清远', '日照', '黄石', '西宁', '秦皇岛', '大庆', '许昌', '乐山', '运城', '吉安', '宝鸡', '怀化', '渭南', '焦作', '拉萨', '益阳', '长治', '达州', '盘锦', '黄山', '阳江', '齐齐哈尔', '锦州', '晋城', '汕尾', '衢州', '驻马店', '鞍山', '茂名', '吉林', '开封', '召阳', '亳州', '榆林', '曲靖', '张家口', '抚州', '韶关', '三明', '眉山', '营口', '赤峰', '北海', '凉山', '玉林', '临汾', '内江', '大理', '鄂州', '毕节', '德阳', '郴州', '宿州', '孝感', '宣城', '衡水', '红河', '咸宁', '河源', '恩施', '延边', '铜陵', '新余', '宜宾', '滨州', '泸州', '晋中', '南平', '黔南', '濮阳', '梅州', '景德镇', '娄底', '承德', '丹东', '汉中', '龙岩', '黄冈', '湘潭', '平顶山', '淮南', '十堰', '黔东南', '潮州', '大同', '永州', '荆门', '淮北', '玉溪'];
// 五线
const FifthTierCity = ['佳木斯', '遂宁', '延安', '鹰潭', '梧州', '池州', '昌吉', '钦州', '牡丹江', '西双版纳', '忻州', '抚顺', '萍乡', '普洱', '铜仁', '张家界', '漯河', '安顺', '保山', '广安', '阿克苏', '天水', '资阳', '丽江', '百色', '贺州', '吕梁', '葫芦岛', '云浮', '贵港', '辽阳', '自贡', '六盘水', '随州', '通辽', '锡林郭勒', '昭通', '攀枝花', '广元', '呼伦贝尔', '本浮', '鹤壁', '酒泉', '铁岭', '喀什', '文山', '巴音郭楞', '河池', '通化', '湘西', '雅安', '朝阳', '楚雄', '防城港', '阜新', '白银', '嘉峪关', '黔西南', '儋州', '巴彦淖尔', '哈密', '绥化', '阳泉', '安康', '乌海', '吴忠', '临沧', '伊犁', '来宾', '德宏', '庆阳', '三门峡', '石嘴山', '林芝', '克拉玛依', '武威', '金昌', '白山', '乌兰察布', '松原', '张掖', '塔城', '和田', '定西', '临夏', '白城', '平凉', '辽源', '陇南', '朔州', '鸡西', '巴中', '兴安', '铜川', '阿拉善', '崇左', '商洛', '海西', '七台河', '黑河', '鹤岗', '双鸭山', '四平', '怒江', '阿勒泰', '阿坝', '日喀则', '山南', '伊春', '固原', '甘孜', '中卫', '海东', '昌都', '甘南', '博尔塔拉', '阿里', '吐鲁番', '迪庆', '玉树', '那曲', '克孜勒苏', '大兴安岭', '海南', '黄南', '海北', '三沙', '果洛'];

const locationFastSelectOption = [
  {
    name: '一线',
    value: 'one'
  },
  {
    name: '新一线',
    value: 'newOne'
  },
  {
    name: '二线',
    value: 'two'
  },
  {
    name: '三线',
    value: 'three'
  },
  {
    name: '四线',
    value: 'foure'
  },
  {
    name: '五线',
    value: 'five'
  },
];

export {firstTierCity, newFirstTierCity, secondTierCity, thirdTierCity, FourthTierCity, FifthTierCity, locationFastSelectOption };
